Revit 2027 API
ConduitSizes.Contains Method
 Checks whether a conduit size with the nominal diameter exists.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	double nominalDiameter
)
Public Function Contains (
	nominalDiameter As Double
) As Boolean
public:
bool Contains(
	double nominalDiameter
)
member Contains :
        nominalDiameter : float -> bool
Parameters
nominalDiameter Double
 Nominal diameter.
Return Value
Boolean
 True if a conduit size with the nominal diameter exists.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for nominalDiameter must be greater than 0 and no more than 30000 feet.
See Also
Reference
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace